// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "ส่งใจมาให้เค้าเดี๋ยวนี้",      //这里,每句话结尾的最后一个逗号必须是英文的哦!! 很重要哦!!
        "ผู้หญิงที่เค้ารัก",  // 同上...
        "วันนี้เป็นวันเกิดของเธอคนที่เค้ารัก",
        "วันนี้เราจะใช้เวลาร่วมกันถึงมันจะน้อยนิด T-T",
        "วันเกิดปีแรกที่มีเค้าในชีวิตเธอ",
        "ต้องขอบคุณ Twitch ที่ทำให้เค้าเจอเธอ",
        "เธอดูแปลกๆ",
        "ดูน่ารักมากๆ",
        "ดูเกรี้ยวกราด",
        "เห็นครั้งแรกก็ชอบเลยในทันที ขอบคุณนะ",
        "ปีนี้สิ่งนี้คือของขวัญที่เค้าทำให้เธอ",
        "ขอให้วันเกิดครั้งนี้เป็นวันเกิดที่เธอได้กินแต่ของอร่อย",
        "ขอให้มีสุขภาพที่แข็งแรงเหมือนไซตามะ",
        "แล้วก็ขอให้มีพลังในการทำงานและทำสิ่งต่างๆนะคะ",
        "อีกข้อสำคัญมากคืออย่าลืมคิดถึงเค้าเยอะๆด้วยนะ 555555",
        "สุขสันต์วันเกิดนะคะซาจิ~~",
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
        "ส่งใจมาให้เค้าเดี๋ยวนี้": "./imgs/songxinxin.jpeg",
        "ผู้หญิงที่เค้ารัก": "./imgs/fxTX.gif",
        "วันนี้เป็นวันเกิดของเธอคนที่เค้ารัก": "./imgs/Aq.gif",
        "วันนี้เราจะใช้เวลาร่วมกันถึงมันจะน้อยนิด T-T": "./imgs/Z0Cq.gif",
        "วันเกิดปีแรกที่มีเค้าในชีวิตเธอ": "./imgs/8kq.gif",
        "ต้องขอบคุณ Twitch ที่ทำให้เค้าเจอเธอ": "./imgs/DDg.gif",
        "เธอดูแปลกๆ": "./imgs/1ABW.gif",
        "ดูน่ารักมากๆ": "./imgs/14iC.gif",
        "ดูเกรี้ยวกราด": "./imgs/Aw.gif",
        "เห็นครั้งแรกก็ชอบเลยในทันที ขอบคุณนะ": "./imgs/7PUu.gif",
        "ปีนี้สิ่งนี้คือของขวัญที่เค้าทำให้เธอ": "./imgs/7Jv3.gif",
        "ขอให้วันเกิดครั้งนี้เป็นวันเกิดที่เธอได้กินแต่ของอร่อย": "./imgs/2t.gif",
        "ขอให้มีสุขภาพที่แข็งแรงเหมือนไซตามะ": "./imgs/7CNV.gif",
        "แล้วก็ขอให้มีพลังในการทำงานและทำสิ่งต่างๆนะคะ": "./imgs/GElj.gif",
        "อีกข้อสำคัญมากคืออย่าลืมคิดถึงเค้าเยอะๆด้วยนะ 555555": "./imgs/6nz.gif",
        "สุขสันต์วันเกิดนะคะซาจิ~~": "./imgs/1DvF.gif"
    },
    
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "กดตรงนี้เพื่อเริ่ม ˶˃ ᵕ ˂˶",
        play: "เปิดเพลง 🧸",
        bannar_coming: "เพิ่มสีสักหน่อย ദ്ദി ˵ •̀ ᴗ - ˵ ✧ ",
        balloons_flying: "เหมือนจะขาดอะไรไปนะ ˚.🎀༘⋆",
        cake_fadein: "เค้ก 🎂 ？",
        light_candle: "เทียน 🕯️？",
        wish_message: "Happy Birthday Naka ⋆.˚🦋༘⋆~",
        story: "A MESSAGE FOR YOU ≽^• ˕ • ྀི≼"
    },

    // 结束语
    loveText: 'รักเธอมากๆนะ เค้าอยากให้เธออยู่กับเค้าไปนานๆ รักเธอคนเดียวนะคะ ~'
};
